Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartExcludedPartWarning
There were fabrication parts needed to the make the connection that were excluded from the fabrication service causing the connection to fail. You may try to inlcude these fitting(s) and try again.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartExceededAngleFlexToleranceWarning
The angle flex is greater than the maximum angle flex tolerance defined by the fabrication part. Connections with this part may not be properly aligned and may appear to be skewed.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.AdditionalPartNotLoaded
An additional part was not loaded.